Public Attributes | List of all members
API_RVMDocumentRevision Struct Reference
Revision Management
Represents a Document Revision. More...
#include <APIdefs_Database.h>
 Public Attributes
 API_Guid  | guid
GUID of the Document Revision.
 GS::UniString  | id
ID of the Document Revision.
 GS::UniString  | finalId
ID with optional suffix (- WIP) of the Document Revision.
 short  | userId
The member ID of the owner in TeamWork mode.
 API_RVMDocumentRevisionStatusID  | status
Status of the document revision (issued or opened).
 Int32  | filler
 API_RVMLayoutInfo  | layoutInfo
Layout meta data.
Detailed Description
Represents a Document Revision.
Remarks
You can get all document revisions via ACAPI_Revision_GetRVMDocumentRevisions function.